/*****************************************************************************
File name   : rocme_porting_base.h

Author		: XXX			

Description : The poriting interface & macro definition for BASE module.
	          
Copyright (C) BeiJing SUMAVision, Inc., 2009 .All rights reserved.

History		:
				2009.12.20  		Created 					
*****************************************************************************/
#ifndef _ROCME_PORTING_BASE_H_
#define _ROCME_PORTING_BASE_H_

#ifdef __cplusplus
extern "C" {
#endif

#include "rocme_porting_typedef.h"

//#define rocme_porting_dprintf(fmt, ...)   printf(fmt, ...)

/*****************************************************************************
功能说明: 
    分配内存空间

参数说明:
    输入参数:
        [size] 要分配的内存空间的大小

返    回:
    失败: NULL              
    成功: 内存指针						
*****************************************************************************/
void *rocme_porting_malloc(const INT32_T size);


/*****************************************************************************
功能说明: 
    将ptr对象的储存空间改变为给定的大小size，size可以大于或小于原尺寸。

参数说明:
    输入参数:
        [ptr ] 要改变的内存空间的地址
        [size] 要分配的内存空间的大小

返    回:
    失败: NULL              
    成功: 内存指针	
*****************************************************************************/
void *rocme_porting_realloc(void * ptr, const INT32_T size);


/*****************************************************************************
功能说明: 
    释放内存

参数说明:
    输入参数:
        [ptr] 指向先前由rocme_porting_malloc、rocme_porting_realloc所返回的内存指针

返    回:
    无	
*****************************************************************************/
void rocme_porting_free(void* ptr);


/*****************************************************************************
功能说明: 
    格式化输出数据

参数说明:
    输入参数:
        [fmt] 要格式化输出数据

返    回:
    失败: -1              
    成功: 输出的字节数				
*****************************************************************************/
INT32_T rocme_porting_dprintf(const CHAR_T* fmt, ...);


/*****************************************************************************
功能说明: 
    获取自机顶盒启动以来的毫秒数

参数说明:
    无

返    回:
    失败: -1              
    成功: 自机顶盒启动以来的毫秒数					
*****************************************************************************/
UINT32_T rocme_porting_time_ms(void);


/*****************************************************************************
功能说明: 
    进入机顶盒真待机状态

参数说明:
    无

返    回:
    失败: -1              
    成功:  0					
*****************************************************************************/
INT32_T rocme_porting_standby(void);


/*****************************************************************************
功能说明: 
    获得机顶盒待机状态

参数说明:
    无

返    回:
    1: 支持真待机   --此时可以调用rocme_porting_standby进入真待机状态
    0: 不支持假待机 --此时由中间件控制进入假待机状态					
*****************************************************************************/
INT32_T rocme_porting_standby_mode(void);


/*****************************************************************************
功能说明: 
    重新启动机顶盒 

参数说明:
    无

返    回:
    失败: -1              
    成功:  0					
*****************************************************************************/
INT32_T rocme_porting_reset_system(void);


#ifdef __cplusplus
}
#endif

#endif
