/*****************************************************************************
File name   : rocme_porting_media.h

Author		: XXX			

Description : The poriting interface & macro definition for MEDIA module.
	          
Copyright (C) BeiJing SUMAVision, Inc., 2009 .All rights reserved.

History		:
				2009.12.20  		Created 					
*****************************************************************************/
#ifndef _ROCME_PORTING_MEDIA_H_
#define _ROCME_PORTING_MEDIA_H_

#ifdef __cplusplus
extern "C" {
#endif

#include "rocme_porting_typedef.h"

#define MEDIA_DEVICE_NAME_LEN 32

/*播放器的控制命令*/
typedef enum Roc_Media_Player_IOCtl
{
	ROC_MEDIA_GET_DURATION  = 0, /* 获取节目时长，单位为毫秒 */
	ROC_MEDIA_GET_STATUS    = 1, /* 获取播放器状态，具体状态请参见 ROC_MEDIA_STATUS_TYPE_e 中的定义 */
	ROC_MEDIA_GET_RATE      = 2, /* 获取当前的节目播放速率 */
	ROC_MEDIA_GET_POSITION  = 3, /* 获得当前节目播放的时间，单位为毫秒*/
	ROC_MEDIA_GET_STARTTIME = 4, /* 获得节目的开始时间，单位为毫秒*/
	ROC_MEDIA_GET_ENDTIIME  = 5, /* 获得节目的结束时间，单位为毫秒*/
	ROC_MEDIA_GET_TRANS_NET = 6	 /* 获得码率 */
} Roc_Media_Player_IOCtl_e;


/*播放器的状态*/
typedef enum Roc_Media_Status_Type
{
	ROC_MEDIA_RUNNING = 0,	/* 正常播放状态 */
	ROC_MEDIA_STOPPED = 1,	/* 停止播放状态 */
	ROC_MEDIA_PAUSED  = 2,	/* 暂停状态     */
	ROC_MEDIA_REWIND  = 3,	/* 快退状态     */
	ROC_MEDIA_FORWARD = 4,	/* 快进状态     */
	ROC_MEDIA_SLOW    = 5,	/* 慢放状态     */
	ROC_MEDIA_FINISH  = 6	/* 播放完成状态 */
} Roc_Media_Status_Type_e;


typedef struct MEDIA_FILE_
{
	void * buffer;   //文件指针
	UINT32_T length; //文件长度
	UINT32_T loop;   //播放的循环次数，非负数 0为无限循环 1为播放一次 n为播放n次
} MEDIA_FILE_t;


/*播放器事件回调函数*/
typedef void (*Roc_Player_Event_Notify)(UINT32_T player, INT32_T event, void *param);


/*****************************************************************************
功能说明: 初始化media模块的资源
参数说明:
输入参数:
  
返回:
    失败: -1              
    成功: 0
*****************************************************************************/
INT32_T rocme_porting_media_init(void);

/*****************************************************************************
功能说明: 销毁media模块的资源
参数说明:
输入参数:
  
返回:
    失败: -1              
    成功: 0
*****************************************************************************/
INT32_T rocme_porting_media_term(void);


/*****************************************************************************
功能说明: 打开媒体播放器 
参数说明:
输入参数:
    [des] 播放器名称，字符串 "WAV"或"MP3"
    [cbk] 播放器事件回调函数，可以为NULL
  
返回:
    失败: -1              
    成功: 播放器句柄
*****************************************************************************/
UINT32_T rocme_porting_media_open(const CHAR_T *des, Roc_Player_Event_Notify cbk);


/*****************************************************************************
功能说明: 关闭媒体播放器 
参数说明:
输入参数:
    [player] 播放器句柄

返回:
    失败: -1              
    成功:  0
*****************************************************************************/
INT32_T rocme_porting_media_close(UINT32_T player);


/*****************************************************************************
功能说明: 播放媒体文件 
参数说明:
输入参数:
    [player] 播放器句柄
    [mrl   ] 要播放的媒体文件描述，结构见MEDIA_FILE_t
    [des   ] 播放器名称, "MP3" or "WAV"
返回:
    失败: -1              
    成功:  0
*****************************************************************************/
INT32_T rocme_porting_media_play(UINT32_T player,const CHAR_T *mrl,const CHAR_T *des);


/*****************************************************************************
功能说明: 重新播放媒体
参数说明:
输入参数:
    [player] 播放器句柄
返回:
    失败: -1              
    成功:  0
*****************************************************************************/
INT32_T rocme_porting_media_replay(UINT32_T player);


/*****************************************************************************
功能说明: 停止媒体文件的播放
参数说明:
输入参数:
    [player] 播放器句柄

返回:
    失败: -1              
    成功:  0
*****************************************************************************/
INT32_T rocme_porting_media_stop(UINT32_T player);


/*****************************************************************************
功能说明: 暂停媒体文件的播放
参数说明:
输入参数:
    [player] 播放器句柄

返回:
    失败: -1              
    成功:  0
*****************************************************************************/
INT32_T rocme_porting_media_pause(UINT32_T player);


/*****************************************************************************
功能说明: 恢复媒体文件的播放
参数说明:
输入参数:
    [player] 播放器句柄

返回:
    失败: -1              
    成功:  0
*****************************************************************************/
INT32_T rocme_porting_media_resume(UINT32_T player);


/*****************************************************************************
功能说明: 快进播放函数
参数说明：
输入参数：
    [player] 播放器句柄
    [  rate] 快进的倍速

返回:
    成功:  0
    失败: -1
*****************************************************************************/
INT32_T rocme_porting_media_forward_rate(UINT32_T player,INT32_T rate);


/*****************************************************************************
功能说明: 快退播放函数
参数说明：
输入参数：
    [player] 播放器句柄
    [  rate] 快退的倍速

返回:
    成功:  0
    失败: -1
*****************************************************************************/
INT32_T rocme_porting_media_rewind_rate(UINT32_T player, INT32_T rate);


/*****************************************************************************
功能说明: 播放器控制函数
参数说明：
    输入参数：
        [player] 播放器句柄
        [    op] 操作类型，详见Roc_Media_Player_IOCtl_e
        [ param] 返回的控制信息

返回:
    成功:  0
    失败: -1
*****************************************************************************/
INT32_T rocme_porting_media_ioctl(UINT32_T player, Roc_Media_Player_IOCtl_e op, void *param);


/*****************************************************************************
功能说明: 设置播放器窗口的位置和大小
参数说明:
输入参数:
    [  x,y] 窗口的坐标位置
    [width] 窗口的宽度
    [ high] 窗口的高度
返回:
    失败: -1              
    成功:  0
*****************************************************************************/
INT32_T rocme_porting_media_set_window(INT32_T x , INT32_T y, UINT32_T width, UINT32_T high);


/*****************************************************************************
功能说明: 从指定的时间点播放媒体文件，单位为秒
参数说明:
输入参数:
    [player] 播放器句柄
    [time  ] 要播放的时间点，单位为秒
返回:
    失败: -1              
    成功:  0
*****************************************************************************/
INT32_T rocme_porting_media_seekplay(UINT32_T player ,INT32_T Time);


#ifdef __cplusplus
}
#endif

#endif

